MikroElektronika/mikrosdk_v2/targets/arm/mikroe/stm32/src/uart/implementation_1/hal_ll_uart.c
/****************************************************************************
**
** Copyright (C) ${COPYRIGHT_YEAR} MikroElektronika d.o.o.
** Contact: https://www.mikroe.com/contact
**
** This file is part of the mikroSDK package
**
** Commercial License Usage
**
** Licensees holding valid commercial NECTO compilers AI licenses may use this
** file in accordance with the commercial license agreement provided with the
** Software or, alternatively, in accordance with the terms contained in
** a written agreement between you and The MikroElektronika Company.
** For licensing terms and conditions see
** https://www.mikroe.com/legal/software-license-agreement.
** For further information use the contact form at
** https://www.mikroe.com/contact.
**
**
** GNU Lesser General Public License Usage
**
** Alternatively, this file may be used for
** non-commercial projects under the terms of the GNU Lesser
** General Public License version 3 as published by the Free Software
** Foundation: https://www.gnu.org/licenses/lgpl-3.0.html.
**
** The above copyright notice and this permission notice shall be
** included in all copies or substantial portions of the Software.
**
** THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
** OF MERCHANTABILITY, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED
** TO THE WARRANTIES FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
** IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM,
** DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT
** OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE
** OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
**
****************************************************************************/
/*!
 * @file  hal_ll_uart.c
 * @brief UART HAL LOW LEVEL layer implementation.
 */

#include "hal_ll_rcc.h"
#include "hal_ll_uart.h"
#include "hal_ll_gpio.h"
#include "hal_ll_core.h"
#include "hal_ll_core_defines.h"
#include "hal_ll_uart_pin_map.h"

/*!< @brief Local handle list */
static volatile hal_ll_uart_handle_register_t hal_ll_module_state[UART_MODULE_COUNT] = { (handle_t *)NULL, (handle_t *)NULL, false };

// ------------------------------------------------------------- PRIVATE MACROS
/*!< @brief Helper macro for getting hal_ll_module_state address */
#define hal_ll_uart_get_module_state_address ((hal_ll_uart_handle_register_t *)*handle)
/*!< @brief Helper macro for getting module specific control register structure base address // first register address */
#define hal_ll_uart_get_handle (hal_ll_uart_handle_register_t *)hal_ll_uart_get_module_state_address->hal_ll_uart_handle
/*!< @brief Helper macro for getting module specific control register structure */
#define hal_ll_uart_get_base_struct(_handle) ((hal_ll_uart_base_handle_t *)_handle)
/*!< @brief Helper macro for getting module specific base address directly from HAL layer handle */
#define hal_ll_uart_get_base_from_hal_handle ((hal_ll_uart_hw_specifics_map_t *)((hal_ll_uart_handle_register_t *)\
                                             (((hal_ll_uart_handle_register_t *)(handle))->hal_ll_uart_handle))->hal_ll_uart_handle)->base

/*!< @brief Macros used for calculating actual baud rate value and error value */
#define HAL_LL_UART_ACCEPTABLE_ERROR (float)1.0
#define hal_ll_uart_get_baud(_clock,_baud,_div) (((_clock/(float)_baud)/_div)-1)
#define hal_ll_uart_get_real_baud(_clock,_baud,_div) (_clock/(_div*(_baud+1)))
#define hal_ll_uart_get_baud_error(_baud_real,_baud) (((float)(abs(_baud_real-_baud))/_baud)*100)
#define hal_ll_uart_check_stop_bit_availability(module_number,uart4_or_uart5,stop_bits_select) \
        if( module_number == uart4_or_uart5 && \
           ( HAL_LL_UART_STOP_BITS_HALF == stop_bits_select || \
             HAL_LL_UART_STOP_BITS_ONE_AND_A_HALF == stop_bits_select )) \
            return HAL_LL_UART_ERROR;

/*!< @brief Macros defining bit location */
#if defined(STM32F4xx) || defined(STM32F2xx)
#define HAL_LL_USART1EN 4
#elif defined(STM32F1xx) || defined(STM32L1xx)
#define HAL_LL_USART1EN 14
#endif
#define HAL_LL_USART2EN 17
#define HAL_LL_USART3EN 18
#define HAL_LL_UART4EN 19
#define HAL_LL_UART5EN 20
#define HAL_LL_USART6EN 5
#define HAL_LL_UART7EN 30
#define HAL_LL_UART8EN 31
#define HAL_LL_UART9EN 6
#define HAL_LL_UART10EN 7

#define HAL_LL_UART_CR1_UE 13
#define HAL_LL_UART_CR1_TE 3
#define HAL_LL_UART_CR1_RE 2

#define HAL_LL_UART_SR_RXNE 5
#define HAL_LL_UART_SR_TXE 7

/*!< @brief Macros defining register bit values */
#define STOP_BITS_HALF 0x1000U
#define STOP_BITS_ONE 0x0U
#define STOP_BITS_ONE_AND_A_HALF 0x3000U
#define STOP_BITS_TWO 0x2000U

#define DATA_BIT_8 0x0U
#define DATA_BIT_9 0x1000U

#define PARITY_NO 0x0U
#define PARITY_ENABLED 0x400U
#define PARITY_EVEN 0x0U
#define PARITY_ODD 0x200U

/*!< @brief Macro used for setting pin alternate functions */
#define HAL_LL_UART_AF_CONFIG (GPIO_CFG_MODE_ALT_FUNCTION | GPIO_CFG_SPEED_HIGH | GPIO_CFG_OTYPE_PP)
#ifdef STM32F1xx
#define HAL_LL_UART_AF_CONFIG_SPECIAL_CASE (GPIO_CFG_MODE_ALT_FUNCTION | GPIO_CFG_OTYPE_PP)
#endif

/*!< @brief Macros used for interrupts */
#define HAL_LL_UART_IT_MASK 0xFFFFUL
#define HAL_LL_UART_IT_CLEAR_MASK 0x360U
#define HAL_LL_UART_IT_CR1_MASK 0x1F0UL
#define HAL_LL_UART_IT_CR2_MASK 0x40UL
#define HAL_LL_UART_IT_CR3_MASK 0x401UL

#define HAL_LL_UART_CR1_REG_INDEX 1
#define HAL_LL_UART_CR2_REG_INDEX 2
#define HAL_LL_UART_CR3_REG_INDEX 3

#define HAL_LL_UART_IT_PE 0x10000100UL
#define HAL_LL_UART_IT_TXE 0x10000080UL
#define HAL_LL_UART_IT_TC 0x10000040UL
#define HAL_LL_UART_IT_RXNE 0x10000020UL
#define HAL_LL_UART_IT_IDLE 0x10000010UL

#define HAL_LL_UART_IT_LBD 0x20000040UL

#define HAL_LL_UART_IT_CTS 0x30000400UL
#define HAL_LL_UART_IT_ERR 0x30000001UL

#define HAL_LL_UART_STATUS_RXNE_FLAG ( 1U << 5 )
#define HAL_LL_UART_STATUS_TXE_FLAG ( 1U << 7 )

/*!< @brief Macro used for status registed flag check
 * Used in interrupt handlers.
 */
#define hal_ll_uart_get_status_flags(_handle,_flag) (((hal_ll_uart_base_handle_t *)_handle)->sr & _flag)

/*!< @brief Macro used for status register flag clearing
 * Used in interrupt handlers.
 */
#define hal_ll_uart_clear_status_flag(_handle,_flag) (clear_reg_bit( &(((hal_ll_uart_base_handle_t *)_handle)->sr), ( _flag & HAL_LL_UART_IT_CLEAR_MASK ) ) )

