MikroElektronika/mikrosdk_v2/targets/arm/mikroe/stm32/src/uart/implementation_1/hal_ll_uart.c
    for ( tx_index = 0; tx_index < tx_map_size; tx_index++ )
    {
        if ( hal_ll_uart_tx_map[ tx_index ].pin == tx_pin )
        {
            for ( rx_index = 0; rx_index < rx_map_size; rx_index++ )
            {
                if ( hal_ll_uart_rx_map[ rx_index ].pin == rx_pin )
                {
                    if ( hal_ll_uart_tx_map[ tx_index ].base == hal_ll_uart_rx_map[ rx_index ].base ) {
                        // Get module number
                        hal_ll_module_id = hal_ll_uart_tx_map[ tx_index ].module_index;

                        // Map pin names
                        index_list[hal_ll_module_id].pin_tx = tx_index;
                        index_list[hal_ll_module_id].pin_rx = rx_index;

                        // Check if module is taken
                        if ( NULL == handle_map[ hal_ll_module_id ].hal_drv_uart_handle ) {
                            return hal_ll_module_id;
                        } else if ( UART_MODULE_COUNT == ++index_counter ) {
                            return --index_counter;
                        }
                    }
                }
            }
        }
    }

    if ( index_counter ) {
        return hal_ll_module_id;
    } else {
        return HAL_LL_PIN_NC;
    }
}

static hal_ll_uart_hw_specifics_map_t *hal_ll_get_specifics( handle_t handle ) {
    uint8_t hal_ll_module_count = sizeof(hal_ll_module_state) / (sizeof(hal_ll_uart_handle_register_t));
    static uint8_t hal_ll_module_error = sizeof(hal_ll_module_state) / (sizeof(hal_ll_uart_handle_register_t));

    while( hal_ll_module_count-- ) {
        if (hal_ll_uart_get_base_from_hal_handle == hal_ll_uart_hw_specifics_map[hal_ll_module_count].base) {
            return &hal_ll_uart_hw_specifics_map[hal_ll_module_count];
        }
    }

    return &hal_ll_uart_hw_specifics_map[hal_ll_module_error];
}

static void hal_ll_uart_set_clock( hal_ll_uart_hw_specifics_map_t *map, bool hal_ll_state ) {
    switch ( map->module_index )
    {
        #ifdef UART_MODULE_1
        case ( hal_ll_uart_module_num(UART_MODULE_1) ):
            (hal_ll_state == true)?(set_reg_bit( _RCC_APB2ENR, HAL_LL_USART1EN )):(clear_reg_bit( _RCC_APB2ENR, HAL_LL_USART1EN ));
            break;
        #endif
        #ifdef UART_MODULE_2
        case ( hal_ll_uart_module_num(UART_MODULE_2) ):
            (hal_ll_state == true)?(set_reg_bit( _RCC_APB1ENR, HAL_LL_USART2EN )):(clear_reg_bit( _RCC_APB1ENR, HAL_LL_USART2EN ));
            break;
        #endif
        #ifdef UART_MODULE_3
        case ( hal_ll_uart_module_num(UART_MODULE_3) ):
            (hal_ll_state == true)?(set_reg_bit( _RCC_APB1ENR, HAL_LL_USART3EN )):(clear_reg_bit( _RCC_APB1ENR, HAL_LL_USART3EN ));
            break;
        #endif
        #ifdef UART_MODULE_4
        case ( hal_ll_uart_module_num(UART_MODULE_4) ):
            (hal_ll_state == true)?(set_reg_bit( _RCC_APB1ENR, HAL_LL_UART4EN )):(clear_reg_bit( _RCC_APB1ENR, HAL_LL_UART4EN ));
            break;
        #endif
        #ifdef UART_MODULE_5
        case ( hal_ll_uart_module_num(UART_MODULE_5) ):
            (hal_ll_state == true)?(set_reg_bit( _RCC_APB1ENR, HAL_LL_UART5EN )):(clear_reg_bit( _RCC_APB1ENR, HAL_LL_UART5EN ));
            break;
        #endif
        #ifdef UART_MODULE_6
        case ( hal_ll_uart_module_num(UART_MODULE_6) ):
            (hal_ll_state == true)?(set_reg_bit( _RCC_APB2ENR, HAL_LL_USART6EN )):(clear_reg_bit( _RCC_APB2ENR, HAL_LL_USART6EN ));
            break;
        #endif
        #ifdef UART_MODULE_7
        case ( hal_ll_uart_module_num(UART_MODULE_7) ):
            (hal_ll_state == true)?(set_reg_bit( _RCC_APB1ENR, HAL_LL_UART7EN )):(clear_reg_bit( _RCC_APB1ENR, HAL_LL_UART7EN ));
            break;
        #endif
        #ifdef UART_MODULE_8
        case ( hal_ll_uart_module_num(UART_MODULE_8) ):
            (hal_ll_state == true)?(set_reg_bit( _RCC_APB1ENR, HAL_LL_UART8EN )):(clear_reg_bit( _RCC_APB1ENR, HAL_LL_UART8EN ));
            break;
        #endif
        #ifdef UART_MODULE_9
        case ( hal_ll_uart_module_num(UART_MODULE_9) ):
            (hal_ll_state == true)?(set_reg_bit( _RCC_APB2ENR, HAL_LL_UART9EN )):(clear_reg_bit( _RCC_APB2ENR, HAL_LL_UART9EN ));
            break;
        #endif
        #ifdef UART_MODULE_10
        case ( hal_ll_uart_module_num(UART_MODULE_10) ):
            (hal_ll_state == true)?(set_reg_bit( _RCC_APB2ENR, HAL_LL_UART10EN )):(clear_reg_bit( _RCC_APB2ENR, HAL_LL_UART10EN ));
            break;
        #endif

        default:
            break;
    }
}

static void hal_ll_uart_map_pins( uint8_t module_index, hal_ll_uart_pin_id *index_list ) {
    // Map new pins
    hal_ll_uart_hw_specifics_map[module_index].pins.tx_pin.pin_name = hal_ll_uart_tx_map[ index_list[module_index].pin_tx ].pin;
    hal_ll_uart_hw_specifics_map[module_index].pins.rx_pin.pin_name = hal_ll_uart_rx_map[ index_list[module_index].pin_rx ].pin;
    // TX and RX could have different alternate function settings, hence save both AF values
    hal_ll_uart_hw_specifics_map[module_index].pins.tx_pin.pin_af = hal_ll_uart_tx_map[ index_list[module_index].pin_tx ].af;
    hal_ll_uart_hw_specifics_map[module_index].pins.rx_pin.pin_af = hal_ll_uart_rx_map[ index_list[module_index].pin_rx ].af;
}

static void hal_ll_uart_alternate_functions_set_state( hal_ll_uart_hw_specifics_map_t *map, bool hal_ll_state ) {
    module_struct module;

    if ( (map->pins.tx_pin.pin_name != HAL_LL_PIN_NC) && map->pins.rx_pin.pin_name != HAL_LL_PIN_NC ) {
        module.pins[0] = VALUE( map->pins.tx_pin.pin_name, map->pins.tx_pin.pin_af );
        module.pins[1] = VALUE( map->pins.rx_pin.pin_name, map->pins.rx_pin.pin_af );
        module.pins[2] = GPIO_MODULE_STRUCT_END;

        module.configs[0] = HAL_LL_UART_AF_CONFIG;
        #ifdef STM32F1xx
        module.configs[1] = HAL_LL_UART_AF_CONFIG_SPECIAL_CASE;
        #else
        module.configs[1] = HAL_LL_UART_AF_CONFIG;
        #endif
        module.configs[2] = GPIO_MODULE_STRUCT_END;

        /* STM32F1xx specific */
        module.gpio_remap = map->pins.tx_pin.pin_af;

